import { Table } from "./company-investor";

class Sale {
    constructor(data) {
        this.data = data;
    }
}

export const salesItems = [
    new Table(
        [
            'Заказ',
            'Контакты',
            'Дата',
            'Статус',
            'Итого',
        ],

        [
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Обрабатываются'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'На удержании'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Отменено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Обрабатываются'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'На удержании'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Отменено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Обрабатываются'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Отменено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Обрабатываются'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'На удержании'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'На удержании'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
            new Sale(
                [
                    {
                        order: '#634753'
                    },
                    {
                        contact: '202-555-0119'
                    },
                    {
                        date: '2020-05-06 11:24:08'
                    },
                    {
                        status: 'Завершено'
                    },
                    {
                        total: '$328.85'
                    },
                ]
            ),
        ]
    )
]